app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"
---
  def index
    @pins = Pin.all

SELECT  "pins".* FROM "pins" WHERE "pins"."slug" = $1 LIMIT 1  [["slug", "rails-tutorial"]]
SELECT "pins".* FROM "pins"
---
  def show_by_name
    @pin = Pin.find_by_slug(params[:slug])
    @pins = Pin.all